{"posts":[{"title":"About","text":"[Download CV] ⭐️ Hi! I'm Hong Zhaoyang, a third-year undergraduate at the Southern University of Science and Technology (SUSTech) in Shenzhen, China. Since 2024, I have been part of the SUSTech DBGroup under the guidance of Prof. Bo Tang. I am currently a research intern at the University of Michigan, supervised by Prof. Lin Ma. In the next few months, I plan to apply for a CS PhD program for admission in Fall 2026. I enjoy socializing and collaborating with others. Feel free to connect with me! Awards 47th International Collegiate Programming Contest (ICPC) World Finalist (Top 1%, Qualification Regional) 9th China Collegiate Programming Contest (CCPC) Regional 2nd runner-up (Scoreboard) SIGMOD Programming Contest World Finalist (Dashboard) See more repetitive awards here Publications Yangshen Deng, Shiwen Chen, Zhaoyang Hong, Bo Tang. How Does Software Prefetching Work on GPU Query Processing? 20th International Workshop on Data Management on New Hardware (DaMoN), affiliated with SIGMOD , Santiago, Chile, June 2024. Experiences Teaching Assistant, CS209 Introduction to Java Programming, Spring 2024 Teaching Assistant, CS203 Data Structures and Algorithm Analysis, Fall 2024 Student Coach, SUSTech-CPC Competition Team, 2023-2024 Problem Setter and Organizer, 2023 SUSTech Programming Competition (On-Site) Instructor, Olympic in Informatics (OI) Course for The High school Affiliated to Southern University of Science and Technology (HSAS), Summer 2023 Instructor, X-Camp Summer Camp, Summer 2024","link":"/2024/07/11/about/"}],"tags":[],"categories":[],"pages":[{"title":"","text":"SUSTech-Vichy (with Li Haoyu, Chen Luyao) 2022 ICPC Asia Xi'an Regional Contest Gold (qualified for World Final) 2022 ICPC Asia Nanjing Regional Contest Gold 2022 CCPC Guilin Regional Contest Gold SUSTech-Helsinki (with Feng Zhaohang, He Yujun) 2023 ICPC Asia Xi'an Regional Contest Gold 2023 ICPC Asia Hangzhou Regional Contest Gold 2023 CCPC Harbin Regional Contest Gold 2023 CCPC Guilin Regional Contest Gold (2nd runner-up) 2023 ICPC Asia-East Continent Final Contest Silver Personal 2022 SUSTech Programming Contest First Prize 2022 Shenzhen Technology University Programming Contest First Prize 2022 Shenzhen University Programming Contest Second Place","link":"/competitions/index.html"},{"title":"About","text":"[Download CV] ⭐️ Hi! I'm Hong Zhaoyang, a third-year undergraduate at the Southern University of Science and Technology (SUSTech) in Shenzhen, China. Since 2024, I have been part of the SUSTech DBGroup under the guidance of Prof. Bo Tang. I am currently a research intern at the University of Michigan, supervised by Prof. Lin Ma. In the next few months, I plan to apply for a CS PhD program for admission in Fall 2026. I enjoy socializing and collaborating with others. Feel free to connect with me! Awards 47th International Collegiate Programming Contest (ICPC) World Finalist (Top 1%, Qualification Regional) 9th China Collegiate Programming Contest (CCPC) Regional 2nd runner-up (Scoreboard) SIGMOD Programming Contest World Finalist (Dashboard) See more repetitive awards here Publications Yangshen Deng, Shiwen Chen, Zhaoyang Hong, Bo Tang. How Does Software Prefetching Work on GPU Query Processing? 20th International Workshop on Data Management on New Hardware (DaMoN), affiliated with SIGMOD , Santiago, Chile, June 2024. Experiences Teaching Assistant, CS209 Introduction to Java Programming, Spring 2024 Teaching Assistant, CS203 Data Structures and Algorithm Analysis, Fall 2024 Student Coach, SUSTech-CPC Competition Team, 2023-2024 Problem Setter and Organizer, 2023 SUSTech Programming Competition (On-Site) Instructor, Olympic in Informatics (OI) Course for The High school Affiliated to Southern University of Science and Technology (HSAS), Summer 2023 Instructor, X-Camp Summer Camp, Summer 2024","link":"/about/index.html"}]}