{"posts":[{"title":"About","text":"[Download CV] ⭐️ Hi! I'm Hong Zhaoyang, a third-year undergraduate at the Southern University of Science and Technology (SUSTech) in Shenzhen, China. Since 2024, I have been part of the SUSTech DBGroup under the guidance of Prof. Bo Tang. I'm currently a research intern at the University of Michigan, Ann Arbor, supervised by Prof. Lin Ma. A few months from now, I'll apply for a CS PhD program for admission in Fall 2026. I enjoy socializing and collaborating with others. Feel free to connect with me! Awards 47th International Collegiate Programming Contest (ICPC) World Finalist (Top 1%, Qualification Regional) [Remaining similar awards here] 9th China Collegiate Programming Contest (CCPC) Regional 2nd runner-up (Scoreboard) 2024 SIGMOD Programming Contest World Finalist (Dashboard) Publications Yangshen Deng, Shiwen Chen, Zhaoyang Hong, Bo Tang. How Does Software Prefetching Work on GPU Query Processing? 20th International Workshop on Data Management on New Hardware (DaMoN), affiliated with SIGMOD, Santiago, Chile, June 2024. Yangshen Deng, Zhengxin You, Long Xiang, Qilong Li, Peiqi Yuan, Zhaoyang Hong, Yitao Zheng, Wanting Li, Runzhong Li, Haotian Liu, Kyriakos Mouratidis, Man Lung Yiu, Huan Li, Qiaomu Shen, Rui Mao, Bo Tang. AlayaDB: The Data Foundation for Efficient and Effective Long-Context LLM Inference Proceedings of the ACM Conference on Management of Data (SIGMOD, Industry Track), Berlin, Germany, June 2025. Services Teaching Assistant, CS109 Introduction to Java Programming, Spring 2024 Teaching Assistant, CS203 Data Structures and Algorithm Analysis, Fall 2024 Student Coach, SUSTech-CPC Competition Team, 2023-2024 Problem Setter and Organizer, 2023 SUSTech Programming Competition (On-Site) Instructor, Olympiad in Informatics (OI) Course for The High school Affiliated to Southern University of Science and Technology (HSAS), Summer 2023 Instructor, X-Camp Summer Camp, Summer 2024","link":"/2024/07/11/about/"}],"tags":[],"categories":[],"pages":[{"title":"","text":"Team SUSTech-Vichy (with Li Haoyu, Chen Luyao) 2022 ICPC Asia Xi'an Regional Contest Gold (qualified for World Final) 2022 ICPC Asia Nanjing Regional Contest Gold 2022 CCPC Guilin Regional Contest Gold Team SUSTech-Helsinki (with Feng Zhaohang, He Yujun) 2023 ICPC Asia Xi'an Regional Contest Gold 2023 ICPC Asia Hangzhou Regional Contest Gold 2023 CCPC Harbin Regional Contest Gold 2023 CCPC Guilin Regional Contest Gold (2nd runner-up) 2023 ICPC Asia-East Continent Final Contest Silver Personal Contests 2022 SUSTech Programming Contest First Prize 2022 Shenzhen Technology University Programming Contest First Prize 2022 Shenzhen University Programming Contest Second Place","link":"/competitions/index.html"},{"title":"","text":"This is one of the interesting problems I set: [PDF] You can try to solve it if you're a competition programming super fan 🤩.","link":"/SUSTechCPC/index.html"},{"title":"About","text":"[Download CV] ⭐️ Hi! I'm Hong Zhaoyang, a third-year undergraduate at the Southern University of Science and Technology (SUSTech) in Shenzhen, China. Since 2024, I have been part of the SUSTech DBGroup under the guidance of Prof. Bo Tang. I'm currently a research intern at the University of Michigan, Ann Arbor, supervised by Prof. Lin Ma. A few months from now, I'll apply for a CS PhD program for admission in Fall 2026. I enjoy socializing and collaborating with others. Feel free to connect with me! Awards 47th International Collegiate Programming Contest (ICPC) World Finalist (Top 1%, Qualification Regional) [Remaining similar awards here] 9th China Collegiate Programming Contest (CCPC) Regional 2nd runner-up (Scoreboard) 2024 SIGMOD Programming Contest World Finalist (Dashboard) Publications Yangshen Deng, Shiwen Chen, Zhaoyang Hong, Bo Tang. How Does Software Prefetching Work on GPU Query Processing? 20th International Workshop on Data Management on New Hardware (DaMoN), affiliated with SIGMOD, Santiago, Chile, June 2024. Yangshen Deng, Zhengxin You, Long Xiang, Qilong Li, Peiqi Yuan, Zhaoyang Hong, Yitao Zheng, Wanting Li, Runzhong Li, Haotian Liu, Kyriakos Mouratidis, Man Lung Yiu, Huan Li, Qiaomu Shen, Rui Mao, Bo Tang. AlayaDB: The Data Foundation for Efficient and Effective Long-Context LLM Inference Proceedings of the ACM Conference on Management of Data (SIGMOD, Industry Track), Berlin, Germany, June 2025. Services Teaching Assistant, CS109 Introduction to Java Programming, Spring 2024 Teaching Assistant, CS203 Data Structures and Algorithm Analysis, Fall 2024 Student Coach, SUSTech-CPC Competition Team, 2023-2024 Problem Setter and Organizer, 2023 SUSTech Programming Competition (On-Site) Instructor, Olympiad in Informatics (OI) Course for The High school Affiliated to Southern University of Science and Technology (HSAS), Summer 2023 Instructor, X-Camp Summer Camp, Summer 2024","link":"/about/index.html"}]}